Revit 2027 API
Document.GetSubelement(ElementId, Int32) Method
 Gets the subelement referenced by a parent id and subelement id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Subelement GetSubelement(
	ElementId id,
	int subId
)
Public Function GetSubelement (
	id As ElementId,
	subId As Integer
) As Subelement
public:
Subelement^ GetSubelement(
	ElementId^ id,
	int subId
)
member GetSubelement :
        id : ElementId *
        subId : int -> Subelement
Parameters
id ElementId
 Id of the element.
subId Int32
 Id of the sub element.
Return Value
Subelement
 The subelement referenced by the input argument.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
null will be returned if the input id string doesn't reference to a valid element or subelement.
See Also
Reference
Document Class
GetSubelement Overload
Autodesk.Revit.DB Namespace